thesis_topic.tex
% Created 2021-08-16 Mon 18:12
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\usepackage{tabularx}
\author{Philipp Beer}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={Philipp Beer},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.4.5)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{Shape of Time Series}
\label{sec:org03860a5}
\subsection{Topic}
\label{sec:orge54e2d5}
Time Series Search Engine - With this thesis different methods are explored that can be utilized to create a time series search engine with faster retrieval times than using a DTW algorithm to compare the time series to each other.

\subsubsection{First approach}
\label{sec:org89f0aaf}
\begin{itemize}
\item transform all time series to Fourier space via FFT
\item identify the top 3-5 most important frequencies based on power spectrum
\item build a band of frequencies that increases in range on a log scale -> lower frequencies are more important to be the same than higher frequencies
\item order frequencies based on their level of energy
\item compute proximity of series by comparing the overlap of common frequencies if frequencies overlap on the same position
\item compare proximity for hourly series based on DTW total cost function
\end{itemize}

\subsubsection{Issues so far}
\label{sec:orgf514510}
\begin{itemize}
\item parallelization to allow reasonable run time for comparing each series with each other series in M4 (100k series)
\item spectral leakage (some frequencies seem to leak and therefore the same frequency range appears twice in the power spectrum) --> possibly apply some window-function (e.g. Hamming window)
\item Does same (or just similar frequency mean that the series looks similar)?
\item Does it matter whether the energy level is significantly different or not?
\item How to ensure that a single frequency really describes a time series? E.g. measure variance after reconstruction? What is a good threshold for confirming whether the frequency describes the series well?
\item Does time series decomposition improve the results? If so, how to integrate trends?
\end{itemize}

\subsubsection{Next activities}
\label{sec:orgd327d4c}
\begin{itemize}
\item check with fft retransformation how much variance is removed to indicate whether this is meaningful approximation?
\item compute comparison for each series and compute distance for top 5 results per series
\item review Singular Spectral Decomposition as alternative to FFT
\end{itemize}

\subsection{Activities so far}
\label{sec:orged42cbc}
\subsubsection{create DTW computation to find closest time series}
\label{sec:org1043cce}
\begin{itemize}
\item done for hourly M4 data set only
\item 414 time series \textasciitilde{} 15 hours of computation
\item not feasible for remaining series / not feasible for
\end{itemize}
\subsubsection{compute FFT for all time series in M4}
\label{sec:org31de52a}
\begin{itemize}
\item compute FFT
\item create power spectrum
\item create log scaled frequency ranges to apply to the frequencies of each series
\item compute 4 most powerful frequencies of each series
\item compare frequency ranges for each series in M4
\end{itemize}
\subsubsection{Parallelization}
\label{sec:orgf1d7197}
\begin{itemize}
\item find multiprocessing that allows for reasonable execution time for M4 dataset
\end{itemize}


\subsection{geometric comparison (allow for different lenght)}
\label{sec:org44d1dcd}
Can I forecast a similar shape with

What makes a similarity metric good or bad?
\subsection{Similarity metrics}
\label{sec:orgf028a26}
\begin{itemize}
\item serach engine for time series
\item top 10 similar features
\end{itemize}

\subsection{{\bfseries\sffamily TODO} Literature}
\label{sec:orgbf003b4}
\begin{itemize}
\item time series similarity
\item time series retrieval
\item clustering time series
\end{itemize}

\subsection{Similarity}
\label{sec:org35cffad}
\cite{Zhang_2021} --> important paper (check references)
traditional similarity-based methods consider local geometric properties of raw time series or global topological properties
propose framework which considers local geometric features and global topological characteristics of time series data

\cite{Cleasby_2019} -> not really relevant -> biological information


\cite{Santos_2019} -> Pixelwise studies -> not sure what they do!

\cite{Zhang_2020} -> similarity measure TAOT based on optimal transport; interesting method to be tested
\begin{itemize}
\item currently the time adaptivity is achieved distance between time steps -> Are there alternatives?
\begin{itemize}
\item method is confirmed via k-mediods check for effectiveness? How does that work?
\end{itemize}
\end{itemize}

\cite{Zhang_2021} --> mixes geometric and topological properties to compare series



\subsection{Measures of Similarity}
\label{sec:org39b19b3}
\subsubsection{geometric}
\label{sec:orgb3fb82f}
\subsubsection{topological}
\label{sec:org7193a70}

\subsection{Idea pool}
\label{sec:orgd04c8c7}
\begin{itemize}
\item time series analysis
\end{itemize}

\subsection{Search Engine for time series}
\label{sec:org7b5fa7c}
\begin{itemize}
\item take metrics from ts \textbf{geometric} and \textbf{topological} and compute a similarity metric
\end{itemize}
\subsubsection{{\bfseries\sffamily TODO} measure performance cost of calculation}
\label{sec:orgeb49859}
\subsubsection{{\bfseries\sffamily TODO} Apply to real-world scenario -> e.g. M-competition set}
\label{sec:orgd1f88cc}
\subsubsection{Question: What can you do? Maybe take series with similar values (threshold?) and train model and look at forecast results?}
\label{sec:org5e1ba5e}
\subsubsection{{\bfseries\sffamily TODO} checkout UCR classification dataset}
\label{sec:orgce3b05a}

\subsection{Question: How to prove that those series are actually similar? What is the control?}
\label{sec:org046ae14}
\subsubsection{Create synthetic data sets to compute how the metrics are different when one property is changed? E.g. what is the difference b/w sine and cosine?}
\label{sec:org041e20d}
\subsubsection{What if the amplitude is different? What if the periodicity is different?}
\label{sec:org35e3707}

\subsection{Math concepts}
\label{sec:org0d2609d}
\subsubsection{Phase Space}
\label{sec:orge5311ac}
\begin{itemize}
\item every parameter or degree of freedom is represented as an axis of multidimensional space
\item one-dimensional system is called phase line, two-dimensional system is called phase plane
\end{itemize}
\begin{enumerate}
\item Core Idea
\label{sec:org9d3695c}
For every possible state of the system or allowed combination of the values of the system's parameters, a point is included in the multidimensional space. The system is observed over time and the corresponding values for each dimension are traced as line (\textbf{phase space trajectory}) for this system. This can be a high-dimensional space.

The phase space trajectory represents the set of states  compatible  with starting from one particular initial condition (wiki)
\begin{itemize}
\item for TS this means to check from different starting points (maybe cross validation)
\end{itemize}
\item Consequences
\label{sec:org2badbc1}
\begin{itemize}
\item phase space as a whole represents all that a system can be and from the shape qualities of the system can be identified
\end{itemize}
\end{enumerate}
\end{document}